# Belajar pandas

## #01: Menyertakan prefix dan suffix pada kolom data frame

In [83]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [84]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  3  9  3  9  7
1  1  2  9  7  8
2  6  3  2  1  5
3  3  2  4  8  9
4  5  3  4  8  7

In [85]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [86]:
# Menyertakan prefix kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        3        9        3        9        7
1        1        2        9        7        8
2        6        3        2        1        5
3        3        2        4        8        9
4        5        3        4        8        7

In [87]:
#Menyertakan sufix kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        3        9        3        9        7
1        1        2        9        7        8
2        6        3        2        1        5
3        3        2        4        8        9
4        5        3        4        8        7

## #02: Pemilihan baris (rows selection) pada data frame

In [88]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  2  2  1  3  2
1  3  2  4  1  3
2  3  2  2  3  1
3  2  4  1  2  4
4  4  3  2  1  2
5  3  4  4  4  1
6  1  3  3  2  3
7  4  2  2  3  4
8  1  4  2  1  4
9  3  3  4  2  3

In [89]:
# Selection dengan operator logika | (or)
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  3  2  4  1  3
2  3  2  2  3  1
5  3  4  4  4  1
6  1  3  3  2  3
8  1  4  2  1  4
9  3  3  4  2  3

In [90]:
# Selection dengan fungsi isin()
df[df['A'].isin([1,3])]

   A  B  C  D  E
1  3  2  4  1  3
2  3  2  2  3  1
5  3  4  4  4  1
6  1  3  3  2  3
8  1  4  2  1  4
9  3  3  4  2  3

In [91]:
# Mengenal operator negasi ~
df[~df['A'].isin([1,3])]

   A  B  C  D  E
0  2  2  1  3  2
3  2  4  1  2  4
4  4  3  2  1  2
7  4  2  2  3  4

## #03: Konversi tipe data string ke numerik pada kolom data frame

In [92]:
# Persiapan data frame
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df=pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [93]:
df.dtypes

col1    object
col2    object
dtype: object

In [94]:
# konversi tipe data dengan fungsi astype()
df_x = df.astype({'col2':'int64'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [95]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [96]:
# Konversi tipe data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric, errors ='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## #04: Pemiliihan kolom (columns selection) pada pandas data frame berdasarkan tipe data

In [97]:
# Persiapan data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')

df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df=df.reset_index()

df['teks']=list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          7.0          6    A
1 2000-01-01 01:00:00         18.0         16    B
2 2000-01-01 02:00:00          3.0         15    C
3 2000-01-01 03:00:00         17.0         12    D
4 2000-01-01 04:00:00         15.0          3    E

In [98]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [99]:
# memilih kolom bertipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          7.0          6
1         18.0         16
2          3.0         15
3         17.0         12
4         15.0          3

In [100]:
df.select_dtypes(include='float')

   bil_pecahan
0          7.0
1         18.0
2          3.0
3         17.0
4         15.0

In [101]:
df.select_dtypes(include='int')

   bil_bulat
0          6
1         16
2         15
3         12
4          3

In [102]:
# Memilih kolom bertipe data string atau object
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [103]:
# Memilih kolom bertipe data datetime
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [104]:
# Memiliih kolom dengan kombinasi tipe data
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0          7.0          6    A
1         18.0         16    B
2          3.0         15    C
3         17.0         12    D
4         15.0          3    E

## #05: Membalik urutan baris dan kolom pada data frame

In [105]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  5  8  5  1  2
1  9  7  9  2  3
2  2  9  1  7  3
3  6  4  2  1  7
4  7  4  2  8  9

In [106]:
# Membalik urutan kolom
df.loc[:, ::-1]

   E  D  C  B  A
0  2  1  5  8  5
1  3  2  9  7  9
2  3  7  1  9  2
3  7  1  2  4  6
4  9  8  2  4  7

In [107]:
# Membalik urutan baris
df.loc[::-1]

   A  B  C  D  E
4  7  4  2  8  9
3  6  4  2  1  7
2  2  9  1  7  3
1  9  7  9  2  3
0  5  8  5  1  2

In [108]:
# Membalik urutan baris dan melakukan penyesuaian ulang index
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  7  4  2  8  9
1  6  4  2  1  7
2  2  9  1  7  3
3  9  7  9  2  3
4  5  8  5  1  2

## #06: Mengganti nama (label0 kolom pada data frame

In [109]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  7  6  6  7  5
1  3  7  5  9  1
2  9  2  6  9  6
3  2  2  6  2  9
4  6  2  1  7  6

In [110]:
# Mengganti nama (label) untuk sebuah kolom pada data frame
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  7  6     6  7  5
1  3  7     5  9  1
2  9  2     6  9  6
3  2  2     6  2  9
4  6  2     1  7  6

In [111]:
# Mengganti nama (label) untuk banyak kolom pada data frame
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     7       6  6     7  5
1     3       7  5     9  1
2     9       2  6     9  6
3     2       2  6     2  9
4     6       2  1     7  6

## #07: Menghapus missing values pada data frame (NaN)

In [112]:
# Persiapan data frame
df = pd.util.testing.makeMissingDataframe().reset_index() #formula untuk bikin dummy data dengan missing values
df.head()

        index         A         B         C         D
0  mCTeTjBqkp -0.757046       NaN  0.919700  0.786475
1  Yc6yhXmKHm  1.780921  0.886023 -1.399350 -0.381668
2  NlPeApKiSN -0.517000 -0.164029  0.103411  1.066138
3  Q3ZkU7aKXd -1.342403 -0.426898 -1.228908 -0.345364
4  DJRLmoVfPA  0.379111  0.488887 -1.169845  1.125602

In [113]:
df = df.rename(columns={'index' : 'Z'})
df.head()

            Z         A         B         C         D
0  mCTeTjBqkp -0.757046       NaN  0.919700  0.786475
1  Yc6yhXmKHm  1.780921  0.886023 -1.399350 -0.381668
2  NlPeApKiSN -0.517000 -0.164029  0.103411  1.066138
3  Q3ZkU7aKXd -1.342403 -0.426898 -1.228908 -0.345364
4  DJRLmoVfPA  0.379111  0.488887 -1.169845  1.125602

In [114]:
df_backup = df.copy(deep=True)

In [115]:
# Menghapus (drop) setiap kolom yang mengandung missing values
df = df.dropna(axis='columns')
df.head()

            Z
0  mCTeTjBqkp
1  Yc6yhXmKHm
2  NlPeApKiSN
3  Q3ZkU7aKXd
4  DJRLmoVfPA

In [116]:
# Menghapus (drop) setiap baris yang mengandung missing values
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
1  Yc6yhXmKHm  1.780921  0.886023 -1.399350 -0.381668
2  NlPeApKiSN -0.517000 -0.164029  0.103411  1.066138
3  Q3ZkU7aKXd -1.342403 -0.426898 -1.228908 -0.345364
4  DJRLmoVfPA  0.379111  0.488887 -1.169845  1.125602
5  ICPkeUrs8t -0.319210 -0.235582  0.506840 -0.219626

In [117]:
# Persentase missing values untuk tiap kolom
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.166667
B    0.100000
C    0.100000
D    0.033333
dtype: float64

In [118]:
# Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan treshold / ambang batas (presentase missing value)
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         B         C         D
0  mCTeTjBqkp       NaN  0.919700  0.786475
1  Yc6yhXmKHm  0.886023 -1.399350 -0.381668
2  NlPeApKiSN -0.164029  0.103411  1.066138
3  Q3ZkU7aKXd -0.426898 -1.228908 -0.345364
4  DJRLmoVfPA  0.488887 -1.169845  1.125602

## #08: Memeriksa kesamaan antar kolom (series) pada data frame

In [119]:
# Persiapan data frame
data  = {'A':[15, 15, 18, np.nan, 12],'B':[15, 15, 18, np.nan, 12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [120]:
# Mengenal pandas series
# data frame merupakan kumpulan dari data series
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [121]:
type(df['A'])

pandas.core.series.Series

In [122]:
type(df)

pandas.core.frame.DataFrame

In [123]:
# Memeriksa kesamaan dengan operator == (Tidak di rekomendasikan karena apabila dalam data teradap NaN maka akan tidak terbaca dengan baik)
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [124]:
# Memeriksa kesamaan dengan method equals() | Lebih di rekomendasikan
df['A'].equals(df['B'])

True

In [125]:
# Memeriksa kesamaan antar dua data frame
df1 = df.copy(deep=True)
df.equals(df1)

True

In [126]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

## #09: Membagi data frame menjadi dua secara acak

In [127]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0  14   8  15  19  16
1  19  14  15   7  11
2  14   2   6   6   2
3   6   9  14   8   6
4  10  11  18  18  18
5  18  14   5   5  13
6  17   3   7   4  10
7  18  11  16  16  16
8   9  16  17  13  19
9   4   8   9   2   6

In [128]:
# Membagi dua data frame menjadi dua secara acak berdasarkan proporsi tertentu
df.shape

(10, 5)

In [129]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 Shape: {df_1.shape}')
print(f'df_2 Shape: {df_2.shape}')

df_1 Shape: (7, 5)
df_2 Shape: (3, 5)

In [130]:
df_1

    A   B   C   D   E
7  18  11  16  16  16
3   6   9  14   8   6
6  17   3   7   4  10
8   9  16  17  13  19
9   4   8   9   2   6
0  14   8  15  19  16
1  19  14  15   7  11

In [131]:
df_2

    A   B   C   D   E
2  14   2   6   6   2
4  10  11  18  18  18
5  18  14   5   5  13

## #10: Mengganti nama (label) kolom pada data frame berdasarkan pola

In [132]:
# Persiapan data frame
df = pd.read_csv('./Dataset/titanicfull.csv')
df.columns = ['Pclass','Survival status','full Name','Sex ',' Age','Sib SP', 'parch','Ticket','Fare','Cabin','Embarked']
df_backup = df.copy(deep=True)
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [133]:
# Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan _
df.columns = df.columns.str.replace(' ','_').str.lower()
df.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [134]:
# Memangkas kelebihan spasi pada nama kolom
df = df_backup.copy(deep=True)
df.columns = df.columns.str.lower().str.strip().str.replace(' ','_') 
# Remark:
# str.lower() = merubah menjadi huruf kecil
# str.strip() = menghilangkan kelebihan sepasi di awal ataupun diakhir kata
# str.replace() = mengganti huruf
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## #11: Seleksi kolom dan baris pada data frame menggunakan loc

In [135]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0   6  17  10   8   1
1   9  11  15  18   3
2  15  16  19  16   6
3  13  12   2  17   4
4  13   4  18   5  16
5   9   4  14   2   6
6  11  14   8   4   5
7  15   8  15  18  14
8   1  12   5  17  12
9  17  19  19   9  15

In [136]:
# Seleksi kolom dan baris menggunakan loc
df.loc[[0,3,4],['B','E']] #bagian pertama untuk baris, bagian kedua untuk kolom

    B   E
0  17   1
3  12   4
4   4  16

In [137]:
# Seleksi baris dengan kondisi
df.loc[df['B']>10,['B','D','E']]

    B   D   E
0  17   8   1
1  11  18   3
2  16  16   6
3  12  17   4
6  14   4   5
8  12  17  12
9  19   9  15

In [138]:
# Slicing data frame dengan loc
df.loc[0:4, 'B':'D'] #slicing pada loc dataframe start dan End index sifatnya inclusif artinya angka tersebut di turut sertakan | Slicing list hanya start index say inclusive

    B   C   D
0  17  10   8
1  11  15  18
2  16  19  16
3  12   2  17
4   4  18   5

## #12: Membentuk kolom bertipe datetime dari beberapa kolom lain pada pandas data frame

In [139]:
# Persiapan data frame
data = {'day':[1,2,10,25,12], 'month':[1,2,4,5,6], 'year':[2000,2001,2010,2015,2020]} #data dictionary
df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

In [140]:
# Membentuk kolom bertipe datetime
df['penanggalan'] = pd.to_datetime(df[['day','month','year']])
df

   day  month  year penanggalan
0    1      1  2000  2000-01-01
1    2      2  2001  2001-02-02
2   10      4  2010  2010-04-10
3   25      5  2015  2015-05-25
4   12      6  2020  2020-06-12

In [141]:
df.dtypes

day                     int64
month                   int64
year                    int64
penanggalan    datetime64[ns]
dtype: object

## #13: Konversi nilai numerik ke dalam kategori pada data frame

In [142]:
# Persiapan data frame
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99, size=(n_rows,n_cols)),columns=cols)
df

   usia
0    81
1    46
2    14
3     8
4    58
5    50
6    44
7    10
8    13
9    71

In [143]:
# Pengelompokan nilai numerik ke dalam beberapa kategori menggunakan cut()
df['kelompok_usia'] = pd.cut(df['usia'], bins=[0,18,65,99], labels=['anak','dewasa','manula'])
df

   usia kelompok_usia
0    81        manula
1    46        dewasa
2    14          anak
3     8          anak
4    58        dewasa
5    50        dewasa
6    44        dewasa
7    10          anak
8    13          anak
9    71        manula

## #14: Menggabungkan (merge) dua pandas data frame

In [144]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df.head()

    A   B   C   D   E
0  16   9  15   5   1
1   5  10   7  15  12
2  19  18   8   9  17
3  19   1  18  15  14
4   4  16   1  10  19

In [145]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

    A   B   C   D   E
0  16   9  15   5   1
2  19  18   8   9  17
3  19   1  18  15  14

In [146]:
df2 = df.copy(deep=True)
df2 = df2.drop([0,3])
df2

    A   B  C   D   E
1   5  10  7  15  12
2  19  18  8   9  17
4   4  16  1  10  19

In [147]:
# MEnggabungkan dua data frame
df_inner = pd.merge(df1, df2, how='inner')
df_inner #Menghasilkan index baru

    A   B  C  D   E
0  19  18  8  9  17

In [148]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer # nilai duplikasi akan di hilangkan, mostly used in actual case

    A   B   C   D   E
0  16   9  15   5   1
1  19  18   8   9  17
2  19   1  18  15  14
3   5  10   7  15  12
4   4  16   1  10  19

## #15: Memecah nilai string suatu kolom ke dalam beberapa kolom baru pada pandas data frame

In [149]:
# Persiapan data frame
data = {'nama':['Didi Kempot', 'Glen Fredly','Mbah Surip'], 'tempat_kelahiran':['Surakarta, jawa Tengah','Jakarta, DKI Jakarta','Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

          nama        tempat_kelahiran
0  Didi Kempot  Surakarta, jawa Tengah
1  Glen Fredly    Jakarta, DKI Jakarta
2   Mbah Surip   Mojokerto, Jawa Timur

In [150]:
# Memecah nama depan dan nama belakang
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

          nama        tempat_kelahiran nama_depan nama_belakang
0  Didi Kempot  Surakarta, jawa Tengah       Didi        Kempot
1  Glen Fredly    Jakarta, DKI Jakarta       Glen        Fredly
2   Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [151]:
# Memecah nama kota dan propinsi
df[['kota','propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta, jawa Tengah",Didi,Kempot,Surakarta,jawa Tengah
1,Glen Fredly,"Jakarta, DKI Jakarta",Glen,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

## #16: Menata ulang data frame dengan multiple indexes menggunakan unstack()

In [152]:
# Persiapan data frame
df = pd.read_csv('./Dataset/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [153]:
# Data frame dengan multiple indexes dari hasil gouping
df.groupby(['sex','pclass'])['survived'].mean().to_frame() #to_frame() digunakan untuk mempercantik tampilan dalam hal ini tabel

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

In [155]:
# Menata ulang data frame dengan multiple indexes
df.groupby(['sex','pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

## #17: